import { Injectable } from '@angular/core';
import { BehaviorSubject, Observable, of } from 'rxjs';
import { delay } from 'rxjs/operators';

@Injectable({ providedIn: 'root' })
export class BlogsService {
  private mockBlogs: any[] = [
    {
      id: 1,
      title: 'أهمية التجارة الإلكترونية في العصر الحديث',
      content:
        'مع تزايد استخدام الإنترنت، أصبحت التجارة الإلكترونية جزءًا أساسيًا من الاقتصاد العالمي. توفر التجارة الإلكترونية سهولة الوصول إلى الأسواق العالمية وتقلل التكاليف التشغيلية للشركات. أصبح الشراء والبيع عبر الإنترنت الطريقة المثلى للتسوق بسبب مرونتها وسهولة استخدامها. في هذه المقالة، سنناقش كيف يمكن للتجارة الإلكترونية تحسين تجربتك كمستهلك وأهمية أن تتبنى الشركات هذا التحول الرقمي.',

      publishDate: new Date('2024-03-15'),

      imageUrl: 'assets/images/blogimage.png',
      readTime: 5,
    },
    {
      id: 2,
      title: 'كيفية بناء علامة تجارية ناجحة على الإنترنت',
      content:
        'بناء علامة تجارية ناجحة على الإنترنت يتطلب استراتيجية متكاملة تتضمن الهوية البصرية، والتواصل الفعّال مع العملاء، والاستفادة من وسائل التواصل الاجتماعي. الخطوة الأولى هي تحديد رؤيتك وقيمك ومن ثم تطوير محتوى يجذب الجمهور المستهدف. كذلك يجب عليك تحسين موقع الويب الخاص بك ليكون سهل التصفح ومحسّن لمحركات البحث. تعرف على نصائح وإرشادات حول كيفية بناء وتنمية علامتك التجارية عبر الإنترنت في هذه المقالة.',

      publishDate: new Date('2024-04-10'),

      imageUrl: 'assets/images/blogimage.png',
      readTime: 7,
    },
    {
      id: 3,
      title: 'دور الذكاء الاصطناعي في تطوير الأعمال',
      content:
        'الذكاء الاصطناعي أصبح عنصرًا أساسيًا في تحسين كفاءة الأعمال واتخاذ القرارات. يمكن للذكاء الاصطناعي تحليل كميات ضخمة من البيانات بسرعة ودقة، مما يساعد الشركات على التنبؤ بالاتجاهات المستقبلية وتحسين العمليات التجارية. على سبيل المثال، يمكن استخدام الذكاء الاصطناعي في خدمة العملاء عبر تطبيقات الشات بوت، وفي التسويق لتخصيص تجربة المستخدم. اكتشف كيف يمكن للذكاء الاصطناعي أن يحدث ثورة في عالم الأعمال من خلال هذه المقالة.',

      publishDate: new Date('2024-05-05'),

      readTime: 6,
    },
    {
      id: 4,
      title: 'أفضل ممارسات التسويق عبر وسائل التواصل الاجتماعي',
      content:
        'التسويق عبر وسائل التواصل الاجتماعي أصبح من أهم استراتيجيات التسويق في العصر الحديث. توفر هذه المنصات فرصة للشركات للتواصل مباشرة مع جمهورها وتعزيز العلاقات مع العملاء. لنجاح حملة التسويق على وسائل التواصل، يجب تحديد الجمهور المستهدف وإنشاء محتوى جذاب وملائم. بالإضافة إلى ذلك، يجب تحليل البيانات باستمرار لتحسين الأداء وقياس العائد على الاستثمار. اقرأ هذه المقالة لمعرفة أفضل الممارسات والنصائح لتحقيق النجاح في التسويق عبر وسائل التواصل الاجتماعي.',

      publishDate: new Date('2024-06-20'),

      imageUrl: 'assets/images/blogimage.png',
      readTime: 8,
    },
    {
      id: 5,
      title: 'كيفية التعامل مع الإجهاد في بيئة العمل',
      content:
        'الإجهاد في بيئة العمل يمكن أن يؤثر سلبًا على الصحة النفسية والإنتاجية. من المهم تعلم كيفية إدارة الإجهاد للحفاظ على التوازن بين العمل والحياة. تشمل تقنيات التعامل مع الإجهاد تحديد الأولويات، وأخذ فترات راحة منتظمة، وممارسة التأمل أو الرياضة. أيضًا، من المهم التحدث مع الزملاء وطلب المساعدة عند الحاجة. في هذه المقالة، سنتناول نصائح وإرشادات حول كيفية تقليل التوتر والحفاظ على الصحة النفسية في بيئة العمل.',

      publishDate: new Date('2024-07-15'),
      imageUrl: 'assets/images/blogimage.png',
      readTime: 4,
    },
    {
      id: 6,
      title: 'استراتيجيات نمو الأعمال للشركات الصغيرة',
      content:
        'تنمية الأعمال للشركات الصغيرة تتطلب التخطيط الجيد والاستفادة من الموارد المتاحة. يمكن للشركات الصغيرة النمو من خلال تحسين المنتجات والخدمات، وتوسيع قاعدة العملاء، واستخدام التكنولوجيا لزيادة الكفاءة. أيضًا، يمكن أن تكون الشراكات مع الشركات الأخرى مفيدة في الوصول إلى أسواق جديدة. تعرف على استراتيجيات نمو الأعمال وكيفية تطبيقها على شركتك الصغيرة من خلال هذه المقالة.',

      publishDate: new Date('2024-08-10'),
      imageUrl: 'assets/images/blogimage.png',
      readTime: 6,
    },
    {
      id: 7,
      title: 'أهمية التحليل البياني في اتخاذ القرارات',
      content:
        'التحليل البياني أصبح أداة حيوية لاتخاذ القرارات المستنيرة في الأعمال. يمكن أن يساعد التحليل البياني في فهم الأنماط والتوجهات وتحديد الفرص والمخاطر. باستخدام التحليل البياني، يمكن للشركات تحسين العمليات وتخصيص الموارد بكفاءة. في هذه المقالة، سنناقش أهمية التحليل البياني وكيف يمكن أن يساعد في اتخاذ قرارات استراتيجية ومستدامة.',

      publishDate: new Date('2024-09-05'),
      imageUrl: 'assets/images/blogimage.png',
      readTime: 5,
    },
  ];
}
